---
kind: type
id: T:Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ
source: html/ec727cc0-0b36-7e43-371e-329300a73d61.htm
---
# Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ

Presets for given Analytical Projection Z.

## Syntax (C#)
```csharp
public enum SurfaceElementProjectionZ
```